tests/performance/results/moderate/report/statistics.json
{
  "GET /api/programs/3/roadmap" : {
    "transaction" : "GET /api/programs/3/roadmap",
    "sampleCount" : 160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.3562499999999997,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 52.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 23.939999999999372,
    "throughput" : 7.03389457950499,
    "receivedKBytesPerSec" : 23.567668263946896,
    "sentKBytesPerSec" : 1.1333912164241438
  },
  "GET /api/search" : {
    "transaction" : "GET /api/search",
    "sampleCount" : 160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.231249999999999,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 7.034513079797758,
    "receivedKBytesPerSec" : 15.690261595955155,
    "sentKBytesPerSec" : 1.2846229940646294
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 640,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3937499999999976,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 52.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.590000000000032,
    "throughput" : 27.01675883321373,
    "receivedKBytesPerSec" : 97.88298366330365,
    "sentKBytesPerSec" : 4.458820549622187
  },
  "GET /api/programs" : {
    "transaction" : "GET /api/programs",
    "sampleCount" : 160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.70625,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.389999999999986,
    "throughput" : 7.03420381605557,
    "receivedKBytesPerSec" : 55.456179108414666,
    "sentKBytesPerSec" : 1.1746570825639673
  },
  "GET /api/health" : {
    "transaction" : "GET /api/health",
    "sampleCount" : 160,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.28125,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 9.629999999999768,
    "throughput" : 7.028950489829987,
    "receivedKBytesPerSec" : 7.221148354786275,
    "sentKBytesPerSec" : 1.0502240477968632
  }
}