tests/performance/results/smoke/report/statistics.json
{
  "GET /api/programs/3/roadmap" : {
    "transaction" : "GET /api/programs/3/roadmap",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.08,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 11.899999999999991,
    "pct3ResTime" : 22.0,
    "throughput" : 3.9071657419707746,
    "receivedKBytesPerSec" : 13.09129459052903,
    "sentKBytesPerSec" : 0.6295726049074002
  },
  "GET /api/search" : {
    "transaction" : "GET /api/search",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.5799999999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 6.0,
    "throughput" : 3.9114448877415313,
    "receivedKBytesPerSec" : 8.724355589454746,
    "sentKBytesPerSec" : 0.7142970644606118
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.004999999999998,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 146.0,
    "pct1ResTime" : 4.900000000000006,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 80.41000000000054,
    "throughput" : 14.500108750815631,
    "receivedKBytesPerSec" : 52.53457369680273,
    "sentKBytesPerSec" : 2.393084354382658
  },
  "GET /api/programs" : {
    "transaction" : "GET /api/programs",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.240000000000001,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 146.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 10.399999999999949,
    "pct3ResTime" : 146.0,
    "throughput" : 3.8639876352395675,
    "receivedKBytesPerSec" : 30.46286345633694,
    "sentKBytesPerSec" : 0.6452557476816074
  },
  "GET /api/health" : {
    "transaction" : "GET /api/health",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.1199999999999997,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 81.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 4.8999999999999915,
    "pct3ResTime" : 81.0,
    "throughput" : 3.838771593090211,
    "receivedKBytesPerSec" : 3.9437380038387713,
    "sentKBytesPerSec" : 0.5735664587332053
  }
}